jFoster426/SAME70/main.c
#include <stdio.h>
#include <stdlib.h>
#include "same70q21.h"
#include "gpio/gpio.h"
#include "uart/uart.h"
#include "spi/spi.h"
#include "nrf/nrf.h"

// PIOB0, PIOB1, PIOB2, PIOB3 are LED's
int main(void)
{
    gpio_conf(PIOB, PIO_PB0, PIO_OUTPUT);
    gpio_conf(PIOB, PIO_PB1, PIO_OUTPUT);
    gpio_conf(PIOB, PIO_PB2, PIO_OUTPUT);
    gpio_conf(PIOB, PIO_PB3, PIO_OUTPUT);

    // uart_conf(UART0, 115200, UART_NO_PARITY);

    // configure SPI0
    spi_conf(SPI0, 1000000UL, SPI_MODE_0);

    nrf_conf();
    nrf_set_mode(NRF_MODE_RX);
    nrf_set_channel(0x1F);
    nrf_set_data_rate(NRF_DATARATE_1MBPS);
    nrf_set_power_output(NRF_RF_PWR_0);

    uint8_t addr[5] = {0, 1, 2, 3, 4};
    // just a 1 byte packet for simple test
    nrf_open_reading_pipe(NRF_PIPE_1, &addr[0], 5, 1);

    nrf_start_listening();

    uint8_t led_state[4] = {0};

    while (1)
    {
        while (!nrf_is_data_ready());

        uint8_t pos = 0;
        uint8_t pipe_num = nrf_receive_packet(&pos);
        nrf_rx_pipe_size(pipe_num);

        if (nrf_rx_buf[pos] == '1') led_state[0] = 1 - led_state[0];
        if (nrf_rx_buf[pos] == '2') led_state[1] = 1 - led_state[1];
        if (nrf_rx_buf[pos] == '3') led_state[2] = 1 - led_state[2];
        if (nrf_rx_buf[pos] == '4') led_state[3] = 1 - led_state[3];

        gpio_write(PIOB, PIO_PB0, led_state[0]);
        gpio_write(PIOB, PIO_PB1, led_state[1]);
        gpio_write(PIOB, PIO_PB2, led_state[2]);
        gpio_write(PIOB, PIO_PB3, led_state[3]);
    }

    return 0;
}
